;Inno Setup XDELTA Patch Языковой файл v1.3 для ISXPM 2.4.0.0
;Язык: Русский
;Автор: Leonid и Kindly

[ISPATCH]
;Кнопки
START_BUTTON='Старт'
BROWSE_BUTTON='Обзор'
INFO_BUTTON='Информация'
EXIT_BUTTON='Выход'
BACKUP_BUTTON='Резервное копирование'
LOG_BUTTON='Сохранить лог'
MUSIC_BUTTON_PLAY='Музыка'
MUSIC_BUTTON_PAUSE='Музыка'
VERIFY_BUTTON='Cверить хэш'
CLOSE_BUTTON='Закрыть'

;Логи
ROLLBACK_STARTED='Откат начался!'
ROLLBACK_END='Произошла ошибка. Запустился откат. Все обновленные файлы восстановлены.'

FAILED_TO_ROLLBACK='[!]  Ошибка: Не удалось откатить из: '
FAILED_TO_ROLLBACK2=' файл в: '

ROLLBACK_SUCCESS2=' в: '
ROLLBACK_SUCCESS3=' успешно проведен.'

FAILED_TO_DELETE_INCLUDED='[!]  Ошибка: Не удалось удалить включенные: '

INCLUDED_DELETED_SUCCESS2=' успешно удалены.'

INCLUDED_DIR_DELETED2=' пустые и были успешно удалены.'

BACKUP_DIR_DELETED2=' удалена.'

BACKUP_DIR_DELETED_NOT_FULLY2=' была очищена, но некоторые используемые файлы или папки удалить не удалось. Проверьте эту папку для получения подробной информации.'

ROLLBACK_FINISHED='Откат завершен!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Внесение изменений завершено с ошибками!'

EXTRACT_TEMP_PATCH_DATA='Извлечение патч-данных во временную папку...'

START_PATCHING='[Начало сессии обновления]'

TARGET_FILE='--> Целевой файл: '
PATCH_DATA_FILE='=> Файл патч-данных: '
OUTPUT_PATCHED='>> Обновленный: '

ERROR_DELETING_OLD_FILE='[!]  Ошибка при удалении исходного старого файла! Он возможно используется!'

NOT_EXISTS_OR_MISSMATCH='[!]  Ошибка: Файлы для обновления в выбранной папке не существуют или несоответствуют.'
CORRECT_PROBLEM='[!]  Пожалуйста, исправьте проблему и примените патч снова.'

PATCHING_END='[Завершение сессии обновления]'
COPYING_START='[Сессия копирования начата]'

COPY_FAILED='[!]  Ошибка: Не удалось скопировать вложенные файлы: '
COPY_FAILED2=' в:'

COPY_IN_USE='Может быть '
COPY_IN_USE2=' задействован!'

INCLUDED_COPYIED2=' скопирован в: '

COPYING_END='[Сессия копирования завершена]'

TEMP_ROLLBACK_DELETED_IN_USE2=' была очищена, но некоторые используемые файлы или папки удалить не удалось. Проверьте эту папку для получения детальной информации.'

EXTERNAL_COPYIED='Дополнительные внешние файлы были скопированы в: '

STORED_BACKUP='Файлы резервного копирования сохранены в: '

OPERATION_SUCCESS='Операция успешно завершена!'

;Проверки
FIND_BY_WINDOW_NAME='Обнаружено запущенное приложение!'
FIND_BY_WINDOW_NAME2='Закройте, пожалуйста '
FIND_BY_WINDOW_NAME3=', и затем запустите патч снова!'

FIND_BY_CLASS_NAME='Обнаружено запущенное приложение!'
FIND_BY_CLASS_NAME2='Закройте, пожалуйста '
FIND_BY_CLASS_NAME3=', и затем запустите патч снова!'

FIND_BY_MUTEX='Обнаружено запущенное приложение!'
FIND_BY_MUTEX2='Закройте, пожалуйста, '
FIND_BY_MUTEX3=', и затем запустите патч снова!'

FIND_BY_PROC='Обнаружено запущенное приложение!'
FIND_BY_PROC2='Закройте, пожалуйста, '
FIND_BY_PROC3=', и затем запустите патч снова!'

;Ошибки
ORIGINAL_NOT_FOUND='Оригинальной установки не найдено! Пожалуйста, выберите правильный путь!'

ROLLBACK_ERROR='Произошла ошибка при обновлении и патч произвел откат.'
ROLLBACK_ERROR2='Откат измененных файлов завершен. Включенные файлы были удалены.'
ROLLBACK_ERROR3='Удалить папку для резервного копирования: '
ROLLBACK_ERROR4='полностью со всеми файлами и подкаталогами?'

INCORRECR_PATH_ENTERED='Введен неправильный путь! Пожалуйста, выберите папку с установленной программой!'

NOTHING_TO_PATCH='Ошибка! В директории установки нет необходимых файлов для исправления!'
NOTHING_TO_PATCH2='Пожалуйста, проверьте оригинальные файлы или имена файлов в выбранной папке!'
NOTHING_TO_PATCH3='Нет данных для обновления!'
FINISHED_WITH_ERRORS='Патч завершен с ошибками! Проверьте лог для получения подробной информации!'
PATCH_UNSUCCESS='[!]  Во время обновления произошли ошибки!'

;Информация
BROWSE_DIALOG='Пожалуйста, выберите путь к папке назначения:'

PATCHING_PROCESS='Процесс обновления, пожалуйста, подождите...'
PATCH_APPLIED='Обновление завершено!'
PATCH_UNSUCCESS='Во время обновления произошли ошибки!'
PATCHING='Обновление: '
PATCHING_ERROR='Обновление не было применено!'
PATCHING_PREPARING='Подготовка к обновлению...'
COPYING_PROCESS='Процесс копирования, пожалуйста, подождите...'
COPYING_EXTERNAL='Копирование внешних файлов...'
FORM_CLOSED='Окно патча закроется автоматически через '
FORM_CLOSED2=' секунд.'

;новые 0.8
DELETING_JUNKED='[Сессия удаления неиспользуемых файлов начата]'
COMPLETING_JUNKED='[Сессия удаления неиспользуемых файлов завершена]'
JUNKED_REMOVED='--> Удаленный неиспользуемый файл: '
JUNKED_REM_FAILED='[!]  Отказано в удалении неиспользуемого файла: '
FAILED_TO_RESTORE='[!]  Ошибка: Отказано в восстановлении неиспользуемого файла из: '
FAILED_TO_RESTORE2=' в: '
JUNKED_RESTORED='Неиспользуемый файл: '
JUNKED_RESTORED2=' восстановлен успешно.'

; Language update 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='Хэш контрольной суммы не совпадает с оригинальным файлом!'
INCORRECT_HASH2='Пожалуйста, проверьте версию Вашей программы!'
INVALID_HASH='[!]  Ошибка! Неправильная контрольная сумма для: '
VALID_HASH='OK! Правильная контрольная сумма для: '

SET_ATTRIBUTES='Установка файловых атрибутов...'
SET_ATTRIBUTES_FAILED='[!]  Отказано в установке оригинальных атрибутов к файлу: '
SET_ATTRIBUTES_SUCCESS='Файловые атрибуты были установлены успешно!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Атрибуты для некоторых файлов не были установлены!'

HANDLE_ERROR='[!]  Произошла критическая ошибка при доступе к: '

GET_TIME_FAILED='[!]  Отказано в получении атрибутов времени из файла: '
SET_TIME_FAILED='[!]  Отказано в установке атрибутов времени к файлу: '

VERIFICATION_START='Запуск процесса верификации файлов...'
VERIFICATION_FINISH='Верификация контрольных сумм для всех файлов прошла успешно!'

PREPARING_TO_OPERATIONS='Подготовка к следующим операциям, ожидание выгрузки патч-движка...'

FORCE_PATCHING='Обновление запущено в форсированном режиме!'
FORCE_PATCHING2='Будут обновлены только существующие требуемые файлы, все несуществующие будут пропущены...'

COPYING_EXTERNAL_FILE='--> Копирование файла в: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Произошла ошибка при копировании файла: ' 

EXTRACTING_PROCESS='Распаковка внешних файлов...'
EXTRACTING_EXTERNAL_FILE='--> Извлечение файла в: '
EXTERNAL_EXTRACTED='Дополнительные внешние файлы были извлечены в: '
EXTRACTING_START='Процесс извлечения, пожалуйста, подождите...'

EXTRACTING_ERROR='[!]  Распаковка неудачна! Возможно, архив поврежден, либо недостаточно свободного места на диске!'
EXTRACTING_ERROR2='Произошла ошибка при распаковке архива!'
EXTRACTING_ERROR3='Возможно, архив поврежден, либо недостаточно свободного места на диске!'
EXTRACTING_WITH_ERRORS='Распаковка архива завершена с ошибками! Проверьте лог для детальной информации!'

DOWNLOAD_REQUIRED='Этот патч требует загрузку определенных данных из сервера!'
DOWNLOAD_FAILED='[!]  Невозможно продолжить процесс обновления без требуемых данных!'
DOWNLOAD_FAILED2='Пожалуйста, обеспечьте доступ к серверу и попробуйте применить обновление снова!'

DOWNLOAD_MIRROR='Отказано в загрузке файла из основного сервера! Попытка загрузить его из зеркала...'
DOWNLOAD_START='Загружаемые данные: '
DOWNLOAD_START2='В место назначения: '
DOWNLOAD_START3='Общий размер: '

READ_OK='Загрузка завершена успешно!'
CONNECT_ERROR_NETWORK='[!]  Ошибка: Отсутствует Интернет соединение, или оно неактивно в данный момент.'
CONNECT_ERROR_OFFLINE='[!]  Ошибка: Компьютер находится в оффлайн режиме.'
CONNECT_ERROR_INITIALIZE='[!]  Ошибка: Отказано в инициализации пакета для доступа к Интернет.'
CONNECT_ERROR_OPENSESSION='[!]  Ошибка: Отказано в открытии сессии для FTP или HTTP.'
CONNECT_ERROR_CREATEREQUEST='[!]  Ошибка: Отказано в создании запроса HTTP дескриптора.'
CONNECT_ERROR_SENDREQUEST='[!]  Ошибка: Отказано в отправке запроса к HTTP серверу.'
READ_ERROR_DELETEFILE='[!]  Ошибка: Локальный файл существует и его невозможно удалить.'
READ_ERROR_SAVEFILE='[!]  Ошибка: Отказано в сохранении данных в локальный файл.'
READ_ERROR_CANCELED='[!]  Ошибка: Операция загрузки была отменена пользователем.'
READ_ERROR_READDATA='[!]  Ошибка: Отказано в чтении данных из удаленной URL.'
UNKNOWN_ERROR='[!]  Неизвестная ошибка: Код состояния HTTP: '

CANCEL_DOWNLOAD_BUTTON='Отменить загрузку'

;old corrected
TOTAL_PATCHED_FILES='Всего обработано файлов: '
PATCHING_LOG='Лог обновления сохранен в: '
INCLUDED_COPYIED='--> Вложенный файл: '
TEMP_ROLLBACK_DELETED='Временные файлы для отката были удалены в: '
DIRECT_PATCH_DATA='Прямой доступ к патч-данным...'

;Строки
DESCRIPTION='Описание:'
COPYRIGHT='Авторское право:'
CONTACT='Контакты:'
INSTALLATION='Установка:'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='обновление до'
FOUNDED_VERSION='Обнаружена установленная версия: '
VERSION_TO_PATCH='Подготовка к обновлению обнаруженной версии: '

;old corrected:
ALLREADY_UPDATED='Обновление приложения по данному пути выполнено!'
ROLLBACK_SUCCESS='Откат: '
INCLUDED_DIR_DELETED='Включенные папки: '
INCLUDED_DELETED_SUCCESS='Включенные: '
BACKUP_DIR_DELETED='Папка резервного копирования: '
BACKUP_DIR_DELETED_NOT_FULLY='Папка резервного копирования: '
TEMP_ROLLBACK_DELETED_IN_USE='Временная папка для отката: '

; Language update 1.0 for ISXPM 2.0.0.0 release candidate 
EXTRACT_TO_TEMP='Извлечение требуемых временных данных...'
EXTRACT_TO_TEMP2='Процесс извлечения, пожалуйста, подождите...'
FOUNDED_VERSION_READY='Готово к обновлению!'
FILE_NOT_EXISTS='[!]  Требуемый для обработки файл не существует: '

;old corrected:
INSTALL_PATH_NOT_FOUND='Путь установки для требуемой версии не обнаружен! Пожалуйста, выберите его!'
FOUNDED_VERSION2='Обнаружена установленная версия! Готово к обновлению!'
VERIFICATION_UNSUCCESS='[!]  Некоторые файлы отсутствуют, либо имеют неправильную контрольную сумму!'
UNKNOWN_PATCHING_ERROR='[!]  Произошла ошибка при применении патч-данных к: '

; Обновление языка до версии 1.1 для ISXPM 2.2.0.0 
LOG_BTN_STATE='Лог'

S_PATCHING='--> Обновление файла: '
S_COPYING='--> Копирование файла: '
S_EXTRACTING='--> Извлечение файла: '
S_COPYING_EXTERNAL='--> Копирование внешнего файла: '
S_ROLLBACK='--> Откат файла: '
S_DELETING='--> Удаление файла: '
S_JUNKED_RESTORED='--> Востановление неиспользуемого файла: '
S_INVALID_FILE='[!]  Неправильный файл: '
S_VALID_FILE='OK! Правильный файл: '

; Обновление языка до версии 1.2 для ISXPM 2.3.0.0 
VERSION_DETECTING='Определение версии... Пожалуйста, подождите...'

; Обновление языка до версии 1.2.1 для ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  Следующий файл не существует и был пропущен: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Отказано в получении свободного места на '
REQUIRED_SPACE='Требуемый объем для успешного обновления '
SPACE_GB='ГБ!'
SPACE_MB='МБ!'
SPACE_ONLY='Доступно только '
SPACE_GB_FREE='ГБ свободного места на разделе '
SPACE_MB_FREE='МБ свободного места на разделе '
SPACE_FREE_ONLY='Свободно только '
